# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.588866  1.403179  1.379653
c -1.673040 -0.908446 -0.825392
e  0.498469 -1.701510 -1.513492
f -0.462959  0.132721 -0.985762
h  1.005284 -0.419679  0.823845

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.588866  1.403179  1.379653  bar   True
c -1.673040 -0.908446 -0.825392  bar  False
e  0.498469 -1.701510 -1.513492  bar   True
f -0.462959  0.132721 -0.985762  bar  False
h  1.005284 -0.419679  0.823845  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.588866  1.403179  1.379653  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -1.673040 -0.908446 -0.825392  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.498469 -1.701510 -1.513492  bar   True
f -0.462959  0.132721 -0.985762  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  1.005284 -0.419679  0.823845  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [6]:
#### index row 'c' below
df2.loc['c']

one      -1.67304
two     -0.908446
three   -0.825392
four          bar
five        False
Name: c, dtype: object

In [7]:
#### index column 'two' below
df2.two

a    1.403179
b         NaN
c   -0.908446
d         NaN
e   -1.701510
f    0.132721
g         NaN
h   -0.419679
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [8]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [9]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [10]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN  1.403179
c       NaN -0.908446
e       NaN -1.701510
f -0.462959  0.132721
h  1.005284 -0.419679

In [11]:
b = df[['one','two','three']]
b

        one       two     three
a  0.588866  1.403179  1.379653
c -1.673040 -0.908446 -0.825392
e  0.498469 -1.701510 -1.513492
f -0.462959  0.132721 -0.985762
h  1.005284 -0.419679  0.823845

In [12]:
a + b

        one  three       two
a       NaN    NaN  2.806358
c       NaN    NaN -1.816892
e       NaN    NaN -3.403021
f -0.925918    NaN  0.265441
h  2.010567    NaN -0.839357

In [13]:
b + a

        one  three       two
a       NaN    NaN  2.806358
c       NaN    NaN -1.816892
e       NaN    NaN -3.403021
f -0.925918    NaN  0.265441
h  2.010567    NaN -0.839357

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [14]:
a['one'].dropna()

f   -0.462959
h    1.005284
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [15]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  1.403179
c -0.908446
e -1.701510
f  0.132721
h -0.419679

In [16]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  2.806358
c       NaN -1.816892
e       NaN -3.403021
f -0.925918  0.265441
h  2.010567 -0.839357

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [17]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  2.806358
c       NaN -1.816892
e       NaN -3.403021
f -0.925918  0.265441
h  2.010567 -0.839357

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [18]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [19]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [20]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [21]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [ ]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [24]:
#### insert your code here
# fill missing values in column one with value 1
rand_df = rand_df.fillna(0)
# fill missing values in column two with forward-filling
rand_df.fillna(method='ffill')
# fill missing vallues in column three with backward-filling
rand_df.fillna(method='bfill')

NameError: name 'rand_df' is not defined

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [ ]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

In [ ]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

In [ ]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

In [ ]:
df_filled = my_df.fillna(my_df.mean())
df_filled

In [ ]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.